jobportalbackend/app/controllers/candidateprofile_controller.rb

    def index
        render json: Candidateprofile.all
---
SELECT "candidateprofiles".* FROM "candidateprofiles"

    def show
        v = Candidateprofile.find(params[:id])
---
SELECT "candidateprofiles".* FROM "candidateprofiles" WHERE "candidateprofiles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
        puts "post Candidateprofile req"

        v = !params[:firstName].empty? and !params[:email].empty? and !params[:resumelink].empty?
        if (v)
              p=Candidateprofile.create(
                'firstName': params[:firstName],
                'lastName': params[:lastName],
                'email': params[:email],
                'contact': params[:contact],
                'address': params[:address],
                'about': params[:about],
                'profilepiclink': params[:profilepiclink],
                'currentcompany': params[:currentcompany],
                'ctc': params[:ctc],
                'experience': params[:experience],
                'currentrole': params[:currentrole],
                'addskills': params[:addskills],
                'resumelink': params[:resumelink],
                'expectedsalary': params[:expectedsalary],
                'preferredlocation': params[:preferredlocation]
            )
---
INSERT INTO "candidateprofiles" ("firstName", "lastName", "email", "contact", "address", "about", "profilepiclink", "currentcompany", "ctc", "experience", "currentrole", "addskills", "resumelink", "expectedsalary", "preferredlocation", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17) RETURNING "id"