jobportalbackend/app/controllers/jobdetail_controller.rb

SELECT "jobdetails".* FROM "jobdetails"
---
    def index
        puts "index jobetails req"
        render json: Jobdetail.all

SELECT "jobdetails".* FROM "jobdetails" WHERE "jobdetails"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        puts "show jobetails req"
        v = Jobdetail.find(params[:id])

INSERT INTO "jobdetails" ("jobtitle", "companyname", "location", "jobType", "salary", "posteddate", "domain", "jobcode", "skillsrequired", "applicationstatus", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
---
    def create
        puts "post jobetails req"

         v = !params[:jobtitle].empty? and !params[:companyname].empty? and !params[:jobcode].empty? and !params[:jobType].empty? and !params[:salary].nil?
        if (v)
              p=Jobdetail.create(
                'jobtitle': params[:jobtitle],
                'companyname': params[:companyname],
                'location': params[:location],
                'jobType': params[:jobType],
                'salary': params[:salary],
                'posteddate': params[:posteddate],
                'domain': params[:domain],
                'jobcode': params[:jobcode],
                'skillsrequired': params[:skillsrequired],
                'applicationstatus': params[:applicationstatus])