jobportalbackend/app/controllers/skill_controller.rb

    def index
        render json: Skill.all
---
SELECT "skills".* FROM "skills"

    def create
        puts "post skill req"

        v = !params[:skillname].empty?
        if (v)
              p=Skill.create(
              'skillname': params[:skillname]
              )
---
INSERT INTO "skills" ("skillname", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["skillname", "html"], ["created_at", "2023-01-25 11:13:29.601722"], ["updated_at", "2023-01-25 11:13:29.601722"]]