jobportalbackend/app/controllers/user_controller.rb

INSERT INTO "users" ("name", "email", "password_digest", "phone_number", "role_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def create
        puts "post user req"

        v = !params[:email].empty? and !params[:password].empty? and !params[:role_id].nil?
        if (v)
              p=User.create(
              'name': params[:name],
              'email': params[:email],
              'password': params[:password],
              'phone_number': params[:phone_number],
              'role_id': params[:role_id])